[
    {
    "range": "0-10",
    "suggestion": "Your score shows a position that is not favourable. Conduct a company-wide survey to gather feedback from employees about their experiences with diversity, equity, and inclusion in the workplace. Offer diversity and inclusion training to all employees to help foster a more inclusive culture and address any unconscious bias that may exist."
    },
    {
    "range": "11-20",
    "suggestion": "Your score shows little priority has been given to DEI prior now. To begin, review your hiring practices to ensure that your job postings and interview processes are inclusive and that you are actively recruiting from diverse candidate pools. Audit your compensation policies to ensure that all employees are being paid fairly and equitably, regardless of their gender, race, or other characteristics."
    },
    {
    "range": "21-30",
    "suggestion": "Your score is low relative to other companies in your industry, a lot needs to be improved drastically and here is our suggestion. Develop a diversity and inclusion strategic plan with specific goals and metrics to track progress over time. Partner with local community organizations to support diversity and inclusion initiatives in your community."
    },
    {
    "range": "31-40",
    "suggestion": "Relative to others in your industry your score needs lot of improvement, but its fair and shows you have taken some efforts. Consider creating employee resource groups or affinity groups to foster a sense of community and support among underrepresented employees. Encourage employees to participate in diversity and inclusion training programs."
    },
    {
    "range": "41-50",
    "suggestion": "This score shows that your company/organization understands the basic importance of DEI, but is still far from achieving it. Conduct a diversity audit to identify areas for improvement and set specific goals for increasing diversity and inclusion within the company. Consider partnering with organizations that promote diversity and inclusion in the workplace."
    },
    {
    "range": "51-60",
    "suggestion": "This is score shows your company/organization takes DEI seriously, albeit, there ares some lapses. To foster an inclusive culture by celebrating diverse backgrounds and perspectives. Encourage employee feedback and actively listen to their concerns. Create a mentorship program for underrepresented employees."
    },
    {
    "range": "61-70",
    "suggestion": "Your score positions your company as one that takes issues of DEI with great seriousness and making efforts to improve it. To get better develop a diversity and inclusion task force to oversee initiatives and ensure accountability. Create a plan for increasing diversity in leadership positions. Provide opportunities for employees to attend diversity and inclusion conferences and events."
    },
    {
    "range": "71-80",
    "suggestion": "Your score shows one thing, that your companies effort towards inclusiveness is making headway. So continue to prioritize diversity and inclusion efforts and integrate them into all aspects of the company culture. Consider implementing a diversity recruitment strategy to attract a more diverse pool of candidates. Regularly assess and adjust the effectiveness of diversity and inclusion initiatives."
    },
    {
    "range": "81-90",
    "suggestion": "This is a great score, and I must commend you for that. Ensure you Maintain a commitment to diversity and inclusion efforts while also seeking new opportunities for improvement. Encourage leadership to be vocal advocates for diversity and inclusion. Consider partnering with organizations to advance diversity and inclusion on a larger scale."
    },
    {
    "range": "91-100",
    "suggestion": "Congratulations on achieving a high level of diversity and inclusion in the workplace!, this is highly commendable. Maintain this commitment by continuing to listen to and address employee concerns, investing in employee development programs, and regularly assessing and adjusting diversity and inclusion initiatives as necessary."
    }
    ]